const facade = new jmotion.Facade("#animation-placeholder");

const rankData = {};
rankData.patternCount = [42,40,38,36,32,31,30,30,28,28,27,27,27,27,27,27,27,27,26,26,26,24,24,24,24,24,23,23,23,23,23,21,20,20,19,18,18,18,17,17,17,17,16,16,16,16,15,15,14,14,14,14,14,14,14,14,13,13,13,13,13,13,13,13,13,13,13,13,13,13,12,12,12,12,12,12,12,12,12,12,12,12,12,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,9,9,9,9,9,9,9,9,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
rankData.patternNoAlpCount = [23,22,22,22,20,20,19,19,19,19,18,18,18,18,18,18,18,18,18,17,17,17,17,17,16,15,14,14,14,14,14,14,14,14,14,12,7,6,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
rankData.asyncCount = [16,15,14,13,13,13,12,12,12,12,12,12,12,12,12,11,11,11,11,11,11,11,11,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,9,9,9,9,9,9,9,9,9,9,9,9,9,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
rankData.asyncNoAlpCount = [8,7,7,6,6,6,6,6,6,6,6,6,6,6,6,6,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
rankData.syncCount = [30,30,26,26,24,24,20,20,20,20,20,20,20,20,20,20,20,18,18,16,16,16,16,16,16,16,16,16,16,16,14,14,12,12,12,12,12,12,10,10,10,10,10,10,10,10,8,8,8,8,8,8,8,8,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
rankData.syncNoAlpCount = [18,18,18,18,14,14,14,14,14,14,14,14,14,14,14,14,12,12,12,12,12,12,12,12,10,10,10,10,10,10,10,10,10,10,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];

let days = [31, 29, 31, 30, 31, 30,
            31, 31, 30, 31, 30, 31];

//サーチ
document.getElementById("search-button").addEventListener("click", () => {
    // 月・日を取得
    const month = Math.floor(Number(document.getElementById("month").value));
    const day = Math.floor(Number(document.getElementById("day").value));

    // チェックボックスを取得
    const useAlp = document.querySelector('input[name="useAlp"]').checked;

    if(month < 0 || day < 0) return;
    let in366 = false;
    if(0 < month && month <= 12){
        if(0 < day && day <= days[month - 1]) in366 = true;
    }

    //検索
    const result = getJugglableBirthdaySiteswap(month, day);

    //データ抽出
    const patterns = result.patterns;
    let patternCount, asyncCount, syncCount, patternRankData, asyncRankData, syncRankData;
    if(useAlp){
        patternCount = result.patternCount;
        asyncCount = result.asyncCount
        syncCount = result.syncCount;
        patternRankData = rankData.patternCount;
        asyncRankData = rankData.asyncCount;
        syncRankData = rankData.syncCount;
    }else{
        patternCount = result.patternNoAlpCount;
        asyncCount = result.asyncNoAlpCount;
        syncCount = result.syncNoAlpCount;
        patternRankData = rankData.patternNoAlpCount;
        asyncRankData = rankData.asyncNoAlpCount;
        syncRankData = rankData.syncNoAlpCount;
    }

    //ランキング計算
    let patternRank, asyncRank, syncRank;
    if(in366){
        for(let i = 0; i < 366; i++){
            if(patternCount >= patternRankData[i]){
                patternRank = String(i + 1);
                break;
            }
        }
        for(let i = 0; i < 366; i++){
            if(asyncCount >= asyncRankData[i]){
                asyncRank = String(i + 1);
                break;
            }
        }
        for(let i = 0; i < 366; i++){
            if(syncCount >= syncRankData[i]){
                syncRank = String(i + 1);
                break;
            }
        }
    }else{
        patternRank = "-";
        asyncRank = "-";
        syncRank = "-";
    }

    document.getElementById("result-date").innerHTML = `${month}月${day}日のサイトスワップ`;
    document.getElementById("result-count").innerHTML = `
        <strong>${patternCount}</strong> 個ヒット (${patternRank}位)<br>
        Async: <strong>${asyncCount}</strong> 個ヒット (${asyncRank}位)<br>
        Sync : <strong>${syncCount}</strong> 個ヒット (${syncRank}位)
    `;
    
    facade.startJuggling("0");

    // 古いカードを削除
    const patternGrid = document.getElementById("pattern-grid");
    patternGrid.innerHTML = "";

    // 新しいカードを作成
    patterns.forEach(pattern => {
        const card = document.createElement("div");
        card.className = "pattern-card";

        if(!useAlp && pattern.useAlp) return;

        card.innerHTML = `
            <div class="pattern">${pattern.siteswapStr}</div>
            <div class="pattern-description">
                ${pattern.noAlpStr}<br>${pattern.balls} balls
            </div>
            <div class="play-icon">▶</div>
        `;

        // カードクリック時
        card.addEventListener("click", () => {

            // 選択状態にする
            document.querySelectorAll(".pattern-card").forEach(c => {
                c.classList.remove("selected");
            });

            card.classList.add("selected");

            // サイトスワップをアニメーションに渡す
            facade.startJuggling(pattern.siteswapStr);

            document.getElementById("animation-placeholder").scrollIntoView();
        });

        patternGrid.appendChild(card);
    });

    document.getElementById("result").scrollIntoView();
});


//説明欄の開閉
document
.querySelectorAll(".info-button")
.forEach(button => {
    button.addEventListener("click", () => {
        const item =
            button.parentElement;

        item.classList.toggle("open");
    });
});
